app/Controllers/Marcas.php

SELECT *
FROM `marca`
---
    public function index(): string
    {

        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();

SELECT *
FROM `marca`
WHERE `idmarca` = '6'
---
    public function edit($idmarca){   //get
        $idmarca = $data['idmarca'] = $idmarca;
        $marcaM = model('MarcaM');
        $data['marca'] = $marcaM->where('idmarca',$idmarca)->findAll();

UPDATE `marca` SET `marca` = 'Sabritas'
WHERE `idmarca` = '6'
---
    public function update(){
        $marcaM = model('MarcaM');
        $idmarca = $_POST['idmarca'];

               $data = [
                   'marca' => $_POST['marca'],

               ];

               $marcaM->set($data)->where('idmarca',$idmarca)->update();