app/Controllers/Marcas.php

SELECT *
FROM `marca`
---
    public function index()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
            return redirect()->to(base_url('/usuario'));
        }
        $data1['nombre'] = $session->get('nombre');

        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();