app/Controllers/Proveedor.php

SELECT *
FROM `Estado`
---
    public function add():string
    {
        $estadoM = model('EstadoM');
        $data['estados'] = $estadoM->findAll();